[{"category": "Snowboarding", "subcategory": "Backcountry snowboards", "price": "$899.00", "description": "A directional splitboard for hoofing it to find deep, untracked lines. Powder-specific rocker with 40mm of taper offers other-worldly levels of float through the good stuff. Triaxial stitched carbon fibre is space-age light and torsionally stable. Poplar paulownia wood core features a tuned flex that retains its pop, while ABS/TPU sidewalls provide telepathic levels of power transfer. Go out as far and deep as you want to, the ScapeGoat knows these realms.", "image_url": "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8839028932638/5048292-BK048.jpg", "name": "G3 Scapegoat Carbon Splitboard - Unisex"},
{"category": "Snowboarding", "subcategory": "Backcountry snowboards", "price": "$859.00", "description": "Burton's most iconic board – the Classic – is finally available in splitty form. The versatile Custom has Burton's PurePop camber profile for playfulness and snap. The early rise tip and tail serve up float that allow you to flow down through the deep stuff. Its directional shape features a slightly longer nose to augment its pop and flow in varying conditions. Durable edges extend slightly beneath the bindings for edge hold when railing in icy hard conditions, and smoothness that's forgiving when riding on softer surfaces.", "image_url": "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8842162831390/5049196-GRN00.jpg", "name": "Burton Custom Splitboard - Men's"},
{"category": "Snowboarding", "subcategory": "Backcountry snowboards", "price": "$989.00", "description": "After K2 proved what the Joy Driver Snowboard was capable of, they brought it back in a split design that's just as sweet. Pro rider Lucas DeBari helped design a board that's perfect for hard charging, riding spines and dropping in to steep lines. Combining the dampness of Bamboo with a directional, camber and a rockered tip, the Joy Driver is very responsive board that floats even in the deepest days.", "image_url": "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8839660044318/5048979-NOC02.jpg", "name": "K2 Joy Driver Splitboard - Men's"},
{"category": "Snowboarding", "subcategory": "Backcountry snowboards", "price": "$729.00", "description": "Seek out deep backcountry lines or shred runs in the sidecountry with this all-mountain splitboard. The lightweight carbon, fibreglass and wood construction lets you fire up ascents with energy to burn, and float gnarly lines with confidence. The go-to all-around choice for freeriders, its rocker is matched with the board sidecut for versatile riding – float powder or hold a solid edge in hard pack.", "image_url": "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8839028473886/5048291-BL022.jpg", "name": "G3 Black Sheep Carbon Splitboard - Unisex"},
{"category": "Sleeping bags, sleeping pads, quilts and pillows", "subcategory": "Sleeping bags", "price": "$179.00", "description": "Get out for some exploring without spending your entire budget on gear. The Centaurus line uses quick-drying synthetic insulation for both value and reliable performance. Synthetics maintain consistent warmth even in damp conditions. Designed with thoughtful touches, it will make your nights better and keep your pack slim and light if you're going to carry it to the campsite. There's a zippered pocket on the draft tube, a 3/4-length zip and 2 loops that let you hang it to dry or air out in the morning.", "image_url": "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8816423698462/5041035-COA03.jpg", "name": "MEC Centaurus -9C Sleeping Bag - Men's"},
{"category": "Sleeping bags, sleeping pads, quilts and pillows", "subcategory": "Sleeping bags", "price": "$229.00", "description": "The Aquilina is an update to the popular MEC Raven. It's a value-oriented down bag that serves you well for backpacking trips, mountaineering, or any sleeping outside opportunity in the spring, summer or fall. It offers the compactness, long life and plushy comfort of a down bag, but the price is close to what you'd expect to pay for a synthetic bag with a similar temperature rating.", "image_url": "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8816364617758/5025627-PDT03.jpg", "name": "MEC Aquilina Sleeping Bag -7C - Women's"},
{"category": "Sleeping bags, sleeping pads, quilts and pillows", "subcategory": "Sleeping bags", "price": "$239.00", "description": "The Aquila is an update to the popular Raven sleeping bag. It's a value-oriented down bag you can take backpacking, mountaineering, or use for sleeping outside through spring, summer, or fall. You'll find it offers the long lifespan and comfort of a down bag at a price you might expect to pay for synthetic.", "image_url": "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8816363208734/5025626-PDT02.jpg", "name": "MEC Aquila Sleeping Bag -7C - Unisex"},
{"category": "Snowboarding", "subcategory": "Backcountry snowboards", "price": "$859.00", "description": "Seek out freedom and ditch the slopeside crowds. A lightweight design and progressive shape means the Anti-Social Splitboard becomes your bestie when making deep-driving turns and riding through chopped-up or variable conditions. The 12mm taper makes the nose wider than the tail, promoting smooth entry and exit from turns, giving it stability at speed and pure float in deep snow. The split channel design is adjustable, fast and easy to engage so you can yo-yo backcountry glades to your heart's content. FSC-certified wood core enhances performance and positive feelings.", "image_url": "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8842163552286/5049199-PPL00.jpg", "name": "Burton Anti Social Splitboard - Women's"},
{"category": "Sleeping bags, sleeping pads, quilts and pillows", "subcategory": "Sleeping bags", "price": "$725.00", "description": "Arguably the best designed, highest performing three-season bag available. It truly pushes the boundaries of its conservative three-season rating. The wind blocking shell and premium quality 850+ fill-power down insulation can be called upon in colder and nastier conditions. Best of all, all this performance is packed into an airy 1.1kg package. The narrow mummy profile offers a close fit for maximum efficiency. With a 150cm shoulder girth, the bag heats quickly and is compact enough to to haul about on any adventure. The Apache also boasts a full 3-D down filled collar to seal in heat. The 13cm baffle spacing offers superior down control and minimizes cold spots. Continuous baffle construction allows you to adjust the fill according to your needs.", "image_url": "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8816334635038/5002400-CRM00.jpg", "name": "Western Mountaineering Apache Gore WS Sleeping Bag -9C - Unisex"},
{"category": "Sleeping bags, sleeping pads, quilts and pillows", "subcategory": "Sleeping pads", "price": "$85.00", "description": "Descended from our popular Kelvin 3.8, the Reactor 3.8 is lighter and more compact, thanks to a tapered shape and strategically cut-out foam. The 3.8 is in the middle of the Reactor series thickness-wise and warmth-wise. It’s a good choice for four-season travellers wanting minimum weight and bulk in their packs, or for three-season users wanting some extra insulation and cushioning.", "image_url": "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8816481402910/5025647-PDT00.jpg", "name": "MEC Reactor 3.8 Sleeping Pad - Unisex"},
{"category": "Snowboarding", "subcategory": "Backcountry snowboard skins", "price": "$195.00", "description": "A light sleek version of G3 skins for alpinists and super-pared-back touring. With up to 16cm of length adjustment, they fit a broad range of ski lengths. The 100% mohair offers fast gliding at minimal weight.", "image_url": "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8841047310366/5048324-BL015.jpg", "name": "G3 Alpinist LT Mohair Skins - Unisex"},
{"category": "Snowboarding", "subcategory": "Backcountry snowboard skins", "price": "$169.00", "description": "Go-anywhere and do-anything nylon skins for tough approaches in varied conditions. With up to 16cm of length adjustment, they fit a broad range of ski lengths. The premium plus nylon offers fast gliding at minimal weight, and gives solid performance on crusty snow, wet goo or blower powder.", "image_url": "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8840685551646/5048293-RED14.jpg", "name": "G3 Alpinist Skins - Unisex"},
{"category": "Snowboarding", "subcategory": "Backcountry snowboard bindings", "price": "$599.00", "description": "Takes seconds to swap these from board to board, so one binding does it for your all-mountain quiver. Needs no tools to make the swap, and it's easier to stack your quiver compactly when you travel. Part of the Prime All-mountain series that's ready for your resort board or your splitboard.", "image_url": "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8842165452830/5049317-BK000.jpg", "name": "Karakoram Connect Splitboard Binding - Men's"},
{"category": "Snowboarding", "subcategory": "Backcountry snowboard skins", "price": "$189.00", "description": "Lighter, fast-gliding climbing skins to take your board higher and further. The skins are precut to fit and feature innovative tip attachments with two pivoting hands that swivel to fit any tip securely. Tails attach securely using a laminated tail connection system with twin-tip clips.", "image_url": "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8839043317790/5048325-RED14.jpg", "name": "G3 Alpinist Splitboard Skins - Unisex"},
{"category": "Boats and boards", "subcategory": "Whitewater kayaks", "price": "$999.00", "description": "A super-popular touring and whitewater hybrid, in a version that offers maximum seating comfort for recreational paddling. 78L of waterproof storage lets you bring loads of camping gear or camera equipment. Drop the built-in skeg for efficient straight-line paddling on mellow water; pull it up for maximum maneuverability on livelier stretches of the river.", "image_url": "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8817747361822/5036178-YLW37.jpg", "name": "Pyranha Fusion RT Kayak"},
{"category": "Boats and boards", "subcategory": "Recreational kayaks", "price": "$119.00", "description": "Start them on the water early with their own boat. This kids' kayak is small, light, and easily dragged around by small folk. The streamlined design keeps the price down and parents happy.", "image_url": "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8817646796830/5031977-LIM00.jpg", "name": "Lifetime Wave Jr. Kayak - Kids' - Children to Youths"},
{"category": "Boats and boards", "subcategory": "Whitewater kayaks", "price": "$999.00", "description": "This cross-over boat bobs and weaves like a hummingbird in whitewater, tracks well on the flat sections and has tons of waterproof storage for camping gear or camera equipment. Its progressive rocker lets you spin on a dime. This version comes with Pyranha’s C4S cockpit outfitting for maximum control in whitewater.", "image_url": "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8850144985118/5040853-YLW37.jpg", "name": "Pyranha Fusion C4S Kayak"},
{"category": "Snowboarding", "subcategory": "Backcountry snowboard skins", "price": "$199.00", "description": "The High Traction version of the G3 Alpinist Climbing Skins grip fiercely on steep, icy uptracks. They offer exceptional traction in hard snow conditions and offer efficiency for big days, slackcountry yo-yoing and peak-bagging.", "image_url": "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8839042793502/5048303-BLU17.jpg", "name": "G3 Alpinist High Traction Skins - Unisex"},
{"category": "Sleeping bags, sleeping pads, quilts and pillows", "subcategory": "Sleeping bags", "price": "$199.00", "description": "The Aquila is an update to the popular Raven sleeping bag. It's a value-oriented down bag you can take backpacking, mountaineering, or use for sleeping outside in the summer. You'll find it offers the long lifespan and comfort of a down bag at a price you might expect to pay for synthetic.", "image_url": "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8816349446174/5025510-CYN09.jpg", "name": "MEC Aquila Sleeping Bag 0C - Unisex"},
{"category": "Boats and boards", "subcategory": "Whitewater kayaks", "price": "$900.00", "description": "Big creeks and big trips, the Exile brings it for both. Continuous rocker, a displacement bow and soft chines deliver speed and response while maintaining forgiveness. The upturned nose guides water downwards, back and around the hull to punch out of holes and resurface already on the move forward. 4 seat pressure pods direct your leans directly into the hull and rails for faster response, greater stability, and better performance. Wide access to the tail and a removable front bulkhead let you pack gear for epic journeys or pro videography.", "image_url": "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8817774952478/5047052-ORG00.jpg", "name": "Titan Exile Kayak"},
{"category": "Boats and boards", "subcategory": "Recreational kayaks", "price": "$599.00", "description": "FeelFree’s smallest sit-on-top provides access to big days out exploring lakes, rivers, ponds, estuaries, and inlets. Part of their Touring Tri Hull Line, it’s made with an emphasis on stability and tracking.", "image_url": "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8817632018462/5024350-FLD01.jpg", "name": "Feelfree Move Kayak"},
{"category": "Sleeping bags, sleeping pads, quilts and pillows", "subcategory": "Sleeping pad accessories", "price": "$16.50", "description": "It isn't always easy for a couple to stay together, but Therm-a-Rest® is doing their best to keep mattresses happily united. This kit is designed to prevent two friendly sleeping pads from going their separate ways.", "image_url": "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8816545857566/5023680-NOC02.jpg", "name": "Therm-a-Rest Universal Couple Kit"},
{"category": "Sleeping bags, sleeping pads, quilts and pillows", "subcategory": "Sleeping pad accessories", "price": "$45.00", "description": "Give your lungs a break and keep breath moisture out of your sleeping pad. Small enough to pack anywhere, this pump fills you NeoAir Pad in about 3 minutes.", "image_url": "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8816546545694/5030999-NOC02.jpg", "name": "Therm-a-Rest NeoAir Mini Pump"},
{"category": "Boats and boards", "subcategory": "Recreational kayaks", "price": "$999.00", "description": "Let the good times roll! The built-in back wheel lets you get this versatile sit-on-top easily across firm, smooth surfaces single-handed. Once afloat, this day-tripper can be paddled as a tandem (with room for a small child or pet in the centre) or as a single. Stable and comfortable, the Corona is just the craft for flat water pleasure cruises or warm water surfing.", "image_url": "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8817619501086/5021230-FLD01.jpg", "name": "Feelfree Corona Kayak"},
{"category": "Sleeping bags, sleeping pads, quilts and pillows", "subcategory": "Sleeping pad accessories", "price": "$295.00", "description": "Upgrade your Therm-a-Rest® cot to a full-on single person shelter. This kit includes the Cot Bug Shelter, so you can stargaze without being distracted by mosquitos. It also comes with a waterproof rain fly to keep you dry when clouds roll through at 3am.", "image_url": "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8816132751390/5045537-GYY00.jpg", "name": "Therm-a-Rest Cot Tent"},
{"category": "Sleeping bags, sleeping pads, quilts and pillows", "subcategory": "Sleeping pad accessories", "price": "$55.00", "description": "Turn your sleeping pad into a camp chair. This chair kit works with NeoAir pads or any 20in. sleeping pad.", "image_url": "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8818231935006/5041059-ORG00.jpg", "name": "Therm-a-Rest Compact Chair 20"},
{"category": "Sleeping bags, sleeping pads, quilts and pillows", "subcategory": "Sleeping pad accessories", "price": "$56.00", "description": "Build a warm, comfy chair wherever you are. Slip an inflatable sleeping pad into this compact adapter and eat or relax in comfort next to the fire.", "image_url": "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8818200018974/5027460-RST00.jpg", "name": "Therm-a-Rest Trekker Chair Kit"},
{"category": "Boats and boards", "subcategory": "Recreational kayaks", "price": "$799.00", "description": "A great single sit-on-top with an additional seat in the bow for a child or pet. Made with an emphasis on stability and tracking, the Juntos is excellent for exploring lakes, rivers, ponds, estuaries and inlets.", "image_url": "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8817629397022/5024349-MEL00.jpg", "name": "Feelfree Juntos Kayak"},
{"category": "Sleeping bags, sleeping pads, quilts and pillows", "subcategory": "Sleeping pads", "price": "$139.00", "description": "More warmth for less weight. The newest generation of these game-changing pads ups the insulation value by 50% while shedding grams. Layers of ThermaCapture lining reflect your body’s radiant heat back at you, making for 3-season comfort at a summer weight.", "image_url": "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8816495820830/5035165-PST01.jpg", "name": "Therm-a-Rest NeoAir Trekker Sleeping Pad - Unisex"},
{"category": "Sleeping bags, sleeping pads, quilts and pillows", "subcategory": "Sleeping pads", "price": "$199.00", "description": "Don't drift apart in the middle of the night. Even when you rig 2 pads to work together you can still get a chilly gap between them. This double pad keeps you close and is thick and toasty enough for 4-season camping.", "image_url": "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8816496377886/5034992-RED00.jpg", "name": "MEC Reactor 6.5 Double Sleeping Pad - Unisex"},
{"category": "Sleeping bags, sleeping pads, quilts and pillows", "subcategory": "Sleeping pads", "price": "$129.00", "description": "The Reactor 6.5 is the thickest mat in the Reactor family. That, combined with its large, non-tapered shape, makes it the pad of choice for four-season campers looking to sleep warm and wide.", "image_url": "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8816480419870/5025645-RED00.jpg", "name": "MEC Reactor 6.5 Sleeping Pad - Unisex"},
{"category": "Sleeping bags, sleeping pads, quilts and pillows", "subcategory": "Sleeping pads", "price": "$83.00", "description": "Grams count and this sleeping pad is one of the lightest, most compact options around. Designed for long-distance hikers, the tapered corners shave weight while providing cushioning and insulation where it matters.", "image_url": "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8816502669342/5041053-POP00.jpg", "name": "Therm-a-Rest Prolite Sleeping Pad - Unisex"},
{"category": "Snowboarding", "subcategory": "Backcountry snowboard bindings", "price": "$73.00", "description": "Having your board rattle, shear and roll is not fun when you've spent the last half day climbing to the top of your dream line. This pair of powerful clips will bring your splitboard to a level of performance you didn't know was possible.", "image_url": "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8842175709214/5049323-NOC02.jpg", "name": "Karakoram Ultra-Clips Splitboard Clips"},
{"category": "Snowboarding", "subcategory": "Backcountry snowboard bindings", "price": "$74.00", "description": "Plates for hard boots or AT boots.", "image_url": "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8817290477598/5017116-NOC02.jpg", "name": "Voile Mtn Plate Kit"},
{"category": "Snowboarding", "subcategory": "Backcountry snowboard boots", "price": "$529.00", "description": "Born on the slopes, raised in the backcountry, the Tourist Boots are based on Burton's ultra-classic Ion. They incorporate a more flexible tongue and mobile collar to ease your time spent walking. For attacking the steeps, a healthy dose of ankle support keeps your heel locked and gives the right amount of toe-to-heel flex. Combined with moisture-wicking liners, these boots are special: super-responsive, comfortable and warm all day long.", "image_url": "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8847039168542/5049201-BK000.jpg", "name": "Burton Tourist Snowboard Boots - Men's"},
{"category": "Snowboarding", "subcategory": "Backcountry snowboard bindings", "price": "$99.00", "description": "Swap your Karakoram Prime bindings from your splitboard over to a solid board in just a few seconds. The Quiver-Connector makes the switch with no twisting screws, and no fumbling trying to remember your stance.", "image_url": "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8841048457246/5049319-NOC02.jpg", "name": "Karakoram Quiver-Connector"},
{"category": "Snowboarding", "subcategory": "Backcountry snowboard boots", "price": "$489.00", "description": "Bag some peaks in backcountry boots purpose-made for snowboard mountaineering. The boot is stiff, responsive and comfortable due to the combination of Endo construction, the Boa® Conda™ liner and the Intuition™ Pro Foam liner. Steep gully climbs, approaches and scrambling are all made easier thanks to the outsoles and compatibility with crampons. Boots that can handle the climbing equally as well as the shredding are boots you need to meet.", "image_url": "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8839666532382/5048981-BK000.jpg", "name": "K2 Aspect Backcountry Snowboard Boot - Men's"},
{"category": "Snowboarding", "subcategory": "Backcountry snowboard boots", "price": "$434.00", "description": "When the crowds are too much, these splitboard boots set you up for backcountry goodness. The most backcountry-ready boots to hit the market, they combine mountaineering boot versatility with snowboard-specific details. Hiking is a fact of life when sniffing out backcountry lines, so these feature a hike mode via the Boa closure system. Outstanding fit and a big degree of stiffness come from the upper wrap cage, that results in telepathic levels of responsiveness. A zippered gaiter covers the laces to keep them from freezing. A burly rubber toe cap provides plenty of protection for kicking steps. Crampon compatible outsoles provide mountain goaty grip on varied terrain.", "image_url": "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8817089544222/5043868-BK000.jpg", "name": "ThirtyTwo Jones MTB Snowboard Boot - Men's"},
{"category": "Boats and boards", "subcategory": "Recreational kayaks", "price": "$1,199.00", "description": "Let the good times roll! This compact sit-on-top is easy to store and easy to carry. The built-in back wheel lets you get this sit-on-top easily across firm, smooth surfaces single handed. Once afloat, it's stable and comfortable, just the boat for a day of photography, fishing, or simple pleasure cruising.", "image_url": "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8817620484126/5021231-ORG00.jpg", "name": "Feelfree Moken 10 Kayak (Standard)"},
{"category": "Boats and boards", "subcategory": "Touring Kayaks", "price": "$799.00", "description": "A fast-inflating solo kayak you can carry in the trunk of your car. The tubeless construction brings a boatload of benefits. It saves weight, won’t trap water so it's easy to assemble and fast to dry, and it can be pumped up to a 50% higher pressure than a bladder-style kayak. Once inflated, the stiff hull is responsive and handles rough water, including rivers up to Class II.", "image_url": "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8817788747806/5049840-RED13.jpg", "name": "Innova Swing I Inflatable Kayak (w/pump)"},
{"category": "Boats and boards", "subcategory": "Touring Kayaks", "price": "$2,260.00", "description": "A seriously re-thought day tripper, with cargo capacity for light overnights. The Delphin tracks like a touring craft on the flat, yet spins like a whitewater boat when you’re dodging through tide races and over falls. The bow resurfaces quickly to punch through waves on the way out and resist pearling on the way in.", "image_url": "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8817713971230/5046273-TRQ00.jpg", "name": "P &H Delphin 155 Kayak w/skeg"},
{"category": "Boats and boards", "subcategory": "Touring Kayaks", "price": "$4,900.00", "description": "A fast, stable tandem with a centre compartment that converts to a third cockpit for Junior or Rover (optional seat required). The Passat G3 is the go-to boat for countless tour companies and adventure racers. Everything the pros love about it – speed, seaworthiness, capacity and quality construction that shrugs off hard knocks – will serve you well on self-guided expeditions. It tracks tightly with the rudder up or down, edges easily, and can cruise at 5 knots. Newly upgraded seats let you cover kilometres in comfort.", "image_url": "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8817670619166/5036523-LME00.jpg", "name": "Seaward Passat G3 K-2 Kayak"},
{"category": "Boats and boards", "subcategory": "Touring Kayaks", "price": "$3,900.00", "description": "A traditional British-style boat, executed with Seaward's innovation and Canadian craftsmanship. The upswept Greenland bow spares your face when parting waves, while the multi-chined hull allows you to carve precisely and won’t surprise you during edges. If the water gets really wild, the low back deck lets you set up sweeps or rolls without arching like a bridge.", "image_url": "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8817671700510/5036524-RED00.jpg", "name": "Seaward Quantum Kayak"},
{"category": "Boats and boards", "subcategory": "Touring Kayaks", "price": "$4,700.00", "description": "Load it up and it's a fast cruiser for extended expeditions. Empty it and it transforms into a playful, fun, and responsive day boat. Stable and efficient, the Cetus' rounded chine, slightly Vee'd hull, and generous bow rocker allow control while running with waves. This High Volume version accommodates paddlers with longer legs and bigger feet, or those wanting maximum cargo capacity. The four-hatch design will suit instructors and expedition sea kayakers looking for a boat for exposed trips and conditions.", "image_url": "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8817632608286/5024351-CUS00.jpg", "name": "P &H Cetus HV Fibreglass Kayak"},
{"category": "Snowboarding", "subcategory": "Backcountry snowboard skins", "price": "$199.00", "description": "The splitty version of the High Traction Skins grip fiercely on steep, icy uptracks. They offer exceptional traction in hard snow conditions and offer efficiency for big days, slackcountry yo-yoing and peak-bagging.", "image_url": "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8841048064030/5048327-BLU17.jpg", "name": "G3 Alpinist Splitboard High Traction Skins - Unisex"},
{"category": "Boats and boards", "subcategory": "Whitewater kayaks", "price": "$999.00", "description": "When is a third degree Burn a good thing? When it’s generation 3 of Pyranha’s cutting-edge river runner. They stretched the hull for improved speed and tracking. Sharper centre and forward edges let you cut like a scalpel as you run and play. The remixed rocker floats high over the tumult while transforming you into a boof master. The redistribution of volume offers a ride that inspires confidence in intermediate paddlers and experts pushing the envelope on steep descents. CS4 outfitting makes the Burn an even more desirable partner for river running and creeking, big drops and expeditions.", "image_url": "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8817759322142/5040848-YLW37.jpg", "name": "Pyranha Burn C4S Kayak"},
{"category": "Snowboarding", "subcategory": "Backcountry snowboard bindings", "price": "$1,099.00", "description": "The sharpest tool in the shed. It meets the demands of elite snowboarders from Alaska to the Arctic Circle and any other place where steep and deep is on the menu. Zero seam movement ensures your ride is solid, while the 4 contact points offer up direct power transfer right out to the edges.", "image_url": "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8841046360094/5049321-BL000.jpg", "name": "Karakoram Prime Carbon Splitboard Binding - Men's"}]